[
    {
        "id": 1,
        "authorId": 1,
        "date": "2023-06-15",
        "categories": ["World News", "Politics"],
        "title": "Global Leaders Gather for Climate Summit",
        "content": "Global leaders gather for emergency summit on climate change. The conference, held in Dubai, brings together representatives from over 190 countries to discuss urgent measures to combat the escalating climate crisis. Key topics include carbon emission reduction targets, renewable energy investments, and climate adaptation funding for vulnerable nations.",
        "excerpt": "Emergency climate summit brings together 190+ countries to discuss urgent measures...",
        "source": "United Nations Climate Change Conference (COP28) official statements and press releases.",
        "featured": true,
        "status": "published"
    },
    {
        "id": 2,
        "authorId": 2,
        "date": "2023-06-12",
        "categories": ["Technology", "Business"],
        "title": "Breakthrough in Quantum Computing Announced",
        "content": "New breakthrough in quantum computing announced by researchers at leading tech institute. The development could revolutionize data processing and cryptography. The quantum processor demonstrated the ability to solve complex problems in minutes that would take traditional supercomputers thousands of years. This advancement has significant implications for fields ranging from medicine to artificial intelligence.",
        "excerpt": "Quantum computing breakthrough solves complex problems in minutes instead of thousands of years...",
        "source": "Nature Journal, Volume 618, Issue 7965, pp. 467-471 (2023)",
        "featured": true,
        "status": "published"
    },
    {
        "id": 3,
        "authorId": 1,
        "date": "2023-06-10",
        "categories": ["Health", "Science"],
        "title": "Study Reveals Benefits of Intermittent Fasting",
        "content": "Major study reveals significant benefits of intermittent fasting for metabolic health. The research, published in the New England Journal of Medicine, followed participants for over a year and found improved insulin sensitivity, reduced inflammation markers, and better cardiovascular health among those practicing time-restricted eating. However, experts caution that the approach may not be suitable for everyone, especially those with certain medical conditions.",
        "excerpt": "Research shows intermittent fasting improves insulin sensitivity and cardiovascular health...",
        "source": "New England Journal of Medicine, Vol. 388, No. 23, June 8, 2023",
        "featured": false,
        "status": "published"
    },
    {
        "id": 4,
        "authorId": 1,
        "date": "2023-06-08",
        "categories": ["Education", "Religion"],
        "title": "New Initiative for Islamic Studies Integration",
        "content": "New initiative launched to integrate Islamic studies with modern education curriculum. The program, developed by scholars and educators, aims to provide a holistic educational approach that combines traditional Islamic knowledge with contemporary academic disciplines. Pilot programs are set to begin in several countries next academic year, with plans for expansion based on initial results and feedback from participating communities.",
        "excerpt": "New program combines traditional Islamic knowledge with modern education curriculum...",
        "source": "International Islamic Education Council annual report and press conference statements.",
        "featured": true,
        "status": "published"
    },
    {
        "id": 5,
        "authorId": 2,
        "date": "2023-06-05",
        "categories": ["Sports", "Entertainment"],
        "title": "Historic Victory for National Team",
        "content": "Historic victory for national team in international championship finals. The underdog team's remarkable performance has captivated the nation, with millions tuning in to watch the final match. The coach's innovative strategy and the players' exceptional teamwork were credited for the unexpected win. Celebrations erupted across the country following the victory, with fans praising the team's dedication and perseverance throughout the tournament.",
        "excerpt": "Underdog national team achieves historic victory in international championship...",
        "source": "International Sports Federation official match report and post-game interviews.",
        "featured": false,
        "status": "published"
    }
]