{
  "1": {
    "en": {
      "title": "AI Breakthrough in Medical Diagnosis",
      "content": "Researchers have developed an AI system that can detect early signs of diseases with 95% accuracy. The system analyzes medical images and patient data to identify patterns invisible to the human eye.",
      "takeaway": "AI could revolutionize early disease detection.",
      "source": "Journal of Medical AI Research, Vol. 12, Issue 4"
    },
    "ar": {
      "title": "طفرة في الذكاء الاصطناعي لتشخيص الأمراض",
      "content": "طور الباحثون نظام ذكاء اصطناعي يمكنه اكتشاف العلامات المبكرة للأمراض بدقة 95٪. يحلل النظام الصور الطبية وبيانات المرضى لتحديد الأنماط غير المرئية للعين البشرية.",
      "takeaway": "يمكن للذكاء الاصطناعي أن يحدث ثورة في الكشف المبكر عن الأمراض.",
      "source": "مجلة أبحاث الذكاء الاصطناعي الطبي، المجلد 12، العدد 4"
    }
  },
  "2": {
    "en": {
      "title": "Gaza Death Disparity: 10,000 Palestinians Under Rubble vs. One Israeli Recovered",
      "content": "Three reports today reveal Israel's staggering moral calculus in Gaza. While launching major military operations to recover a single soldier's body, 10,000 Palestinians remain trapped under rubble - unnamed, unclaimed. Meanwhile, despite announced ceasefires, attacks continue: 3 more Palestinians killed today in Gaza City. The total death toll now stands at 71,660 Palestinians dead with 171,419 injured since October 2023. This isn't just military asymmetry; it's a system that values Israeli life with forensic precision while treating Palestinian death as statistical collateral.",
      "takeaway": "Israel's Gaza campaign shows occupation's brutal math: forensic recovery for occupiers, mass graves for the occupied - proving even in death, Palestinians are denied basic dignity.",
      "source": "https://www.aljazeera.com/news/2026/1/27/gazas-unequal-dead-10000-palestinians-under-rubble-one-israeli-captive | https://www.aa.com.tr/en/middle-east/israeli-strikes-kill-3-palestinians-in-gaza-despite-ceasefire/3811958 | https://qna.org.qa/en/news/news-details?id=israels-offensive-in-gaza-casualty-toll-rises-to-71660-with-171419-injured&date=26/01/2026"
    }
  }
}